1c/src/Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Посещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПосещенияКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/InformationRegisters/ПосещенияКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПосещенияКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПосещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Посещение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/src/AccumulationRegisters/ОстаткиАбонементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАбонементов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1c/src/Documents/Посещение/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ПосещенияКлиентов.Записывать = Истина;

	ДвижениеПосещения = Движения.ПосещенияКлиентов.Добавить();
	ДвижениеПосещения.Клиент = Клиент;
	ДвижениеПосещения.Занятие = Занятие;
	ДвижениеПосещения.АбонементКлиента = АбонементКлиента;
	ДвижениеПосещения.ДокументПосещения = Ссылка;

	Если ЗначениеЗаполнено(АбонементКлиента) Тогда
		Если ОстатокПосещенийАбонемента(АбонементКлиента) < 1 Тогда
			Отказ = Истина;
			Сообщить("Недостаточно посещений по абонементу клиента.");
			Возврат;
		КонецЕсли;

		Движения.ОстаткиАбонементов.Записывать = Истина;

		ДвижениеОстатка = Движения.ОстаткиАбонементов.Добавить();
		ДвижениеОстатка.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеОстатка.Период = Дата;
		ДвижениеОстатка.АбонементКлиента = АбонементКлиента;
		ДвижениеОстатка.КоличествоПосещений = 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОстатокПосещенийАбонемента(АбонементКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| ЕСТЬNULL(Остатки.КоличествоПосещенийОстаток, 0) КАК Остаток
	|ИЗ
	| РегистрНакопления.ОстаткиАбонементов.Остатки(&Момент, АбонементКлиента = &АбонементКлиента) КАК Остатки";
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("АбонементКлиента", АбонементКлиента);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Остаток;
	КонецЕсли;

	Возврат 0;

КонецФункции

#КонецОбласти
